       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPPOSITE.
       AUTHOR. AYSU ONER.
       DATA DIVISION.
       LINKAGE SECTION.
       01 N           PIC S9(8).
       01 RESULT      PIC S9(8).
       PROCEDURE DIVISION USING N RESULT.
           MULTIPLY N BY -1 GIVING RESULT.
       END PROGRAM OPPOSITE.